In [23]:
import pandas as pd

In [24]:
d = pd.read_csv('/home/omid/Desktop/BrentOilPrices.csv')

In [25]:
d.T.loc['Date'].head()
d.head()

           Date  Price
0  May 20, 1987  18.63
1  May 21, 1987  18.45
2  May 22, 1987  18.55
3  May 25, 1987  18.60
4  May 26, 1987  18.63

In [28]:
# for i, f in enumerate(d.index):
#     d['Date'] = pd.to_datetime(f)
d['Date'] = pd.to_datetime(d['Date'])

In [39]:
d.head()

           Date  Price
8024 2019-01-02  54.06
8025 2019-01-03  53.23
8026 2019-01-04  55.64
8027 2019-01-07  57.10
8028 2019-01-08  56.91